
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриНачалеРаботыСистемы() Экспорт
	
	ВызватьМодульМенеджера();
	ВызватьМодульОбъекта();
	ВызватьМодульНабораЗаписей();
	ВызватьМодульМенеджераЗначений();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВызватьМодульМенеджера()
	
	ПланыОбмена.ПланОбмена1.ТестовыйВызов();
	КритерииОтбора.КритерийОтбора1.ТестовыйВызов();
	ХранилищаНастроек.ХранилищеНастроек1.ТестовыйВызов();
	Справочники.Справочник1.ТестовыйВызов();
	Документы.Документ1.ТестовыйВызов();
	Перечисления.Перечисление1.ТестовыйВызов();
	Отчеты.Отчет1.ТестовыйВызов();
	Обработки.Обработка1.ТестовыйВызов();
	РегистрыСведений.РегистрСведений1.ТестовыйВызов();
	ЖурналыДокументов.ЖурналДокументов1.ТестовыйВызов();
	ПланыВидовХарактеристик.ПланВидовХарактеристик1.ТестовыйВызов();
	ПланыСчетов.ПланСчетов1.ТестовыйВызов();
	ПланыВидовРасчета.ПланВидовРасчета1.ТестовыйВызов();
	РегистрыНакопления.РегистрНакопления1.ТестовыйВызов();
	РегистрыБухгалтерии.РегистрБухгалтерии1.ТестовыйВызов();
	РегистрыРасчета.РегистрРасчета1.ТестовыйВызов();
	БизнесПроцессы.БизнесПроцесс1.ТестовыйВызов();
	Задачи.Задача1.ТестовыйВызов();
	
КонецПроцедуры

Процедура ВызватьМодульОбъекта()
	
	ПланыОбмена.ПланОбмена1.СоздатьУзел().ТестовыйВызов();
	Справочники.Справочник1.СоздатьЭлемент().ТестовыйВызов();
	Документы.Документ1.СоздатьДокумент().ТестовыйВызов();
	Отчеты.Отчет1.Создать().ТестовыйВызов();
	Обработки.Обработка1.Создать().ТестовыйВызов();
	ПланыВидовХарактеристик.ПланВидовХарактеристик1.СоздатьЭлемент().ТестовыйВызов();
	ПланыСчетов.ПланСчетов1.СоздатьСчет().ТестовыйВызов();
	ПланыВидовРасчета.ПланВидовРасчета1.СоздатьВидРасчета().ТестовыйВызов();
	БизнесПроцессы.БизнесПроцесс1.СоздатьБизнесПроцесс().ТестовыйВызов();
	Задачи.Задача1.ТестовыйВызов();
		
КонецПроцедуры

Процедура ВызватьМодульНабораЗаписей()
	
	Последовательности.Последовательность1.СоздатьНаборЗаписей().ТестовыйВызов();
	РегистрыСведений.РегистрСведений1.СоздатьНаборЗаписей().ТестовыйВызов();
	РегистрыНакопления.РегистрНакопления1.СоздатьНаборЗаписей().ТестовыйВызов();
	РегистрыБухгалтерии.РегистрБухгалтерии1.СоздатьНаборЗаписей().ТестовыйВызов();
	РегистрыРасчета.РегистрРасчета1.СоздатьНаборЗаписей().ТестовыйВызов();
	РегистрыРасчета.РегистрРасчета1.Перерасчеты.Перерасчет1.СоздатьНаборЗаписей().ТестовыйВызов();
	
КонецПроцедуры

Процедура ВызватьМодульМенеджераЗначений()
	Константы.Константа1.СоздатьМенеджерЗначения().ТестовыйВызов();
КонецПроцедуры

#КонецОбласти
