
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриНачалеРаботыСистемы() Экспорт
	
	ВызватьМодульФормы();
	ВызватьМодульКоманды();
	
	ОбщийМодульВызовСервера.ПриНачалеРаботыСистемы();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВызватьМодульФормы() Экспорт
	
	ПолучитьФорму("ПланОбмена.ПланОбмена1.Форма.Форма");
	ПолучитьФорму("КритерийОтбора.КритерийОтбора1.Форма.Форма");
	ПолучитьФорму("ХранилищеНастроек.ХранилищеНастроек1.Форма.Форма");
	ПолучитьФорму("ОбщаяФорма.Форма");
	ПолучитьФорму("Справочник.Справочник1.Форма.Форма");
	ПолучитьФорму("Документ.Документ1.Форма.Форма");
	ПолучитьФорму("ЖурналДокументов.ЖурналДокументов1.Форма.Форма");
	ПолучитьФорму("Перечисление.Перечисление1.Форма.Форма");
	ПолучитьФорму("Отчет.Отчет1.Форма.Форма");
	ПолучитьФорму("Обработка.Обработка1.Форма.Форма");
	ПолучитьФорму("ПланВидовХарактеристик.ПланВидовХарактеристик1.Форма.Форма");
	ПолучитьФорму("ПланСчетов.ПланСчетов1.Форма.Форма");
	ПолучитьФорму("ПланВидовРасчета.ПланВидовРасчета1.Форма.Форма");
	ПолучитьФорму("РегистрСведений.РегистрСведений1.Форма.Форма");
	ПолучитьФорму("РегистрНакопления.РегистрНакопления1.Форма.Форма");
	ПолучитьФорму("РегистрБухгалтерии.РегистрБухгалтерии1.Форма.Форма");
	ПолучитьФорму("РегистрРасчета.РегистрРасчета1.Форма.Форма");
	ПолучитьФорму("БизнесПроцесс.БизнесПроцесс1.Форма.Форма");
	ПолучитьФорму("Задача.Задача1.Форма.Форма");
	
КонецПроцедуры

Процедура ВызватьМодульКоманды() Экспорт
	
	ВызватьКоманду("ПланОбмена.ПланОбмена1.Команда.Команда1");
	ВызватьКоманду("КритерийОтбора.КритерийОтбора1.Команда.Команда1");
	ВызватьКоманду("ОбщаяКоманда.ОбщаяКоманда1");
	ВызватьКоманду("Справочник.Справочник1.Команда.Команда1");
	ВызватьКоманду("Документ.Документ1.Команда.Команда1");
	ВызватьКоманду("ЖурналДокументов.ЖурналДокументов1.Команда.Команда1");
	ВызватьКоманду("Перечисление.Перечисление1.Команда.Команда1");
	ВызватьКоманду("Отчет.Отчет1.Команда.Команда1");
	ВызватьКоманду("Обработка.Обработка1.Команда.Команда1");
	ВызватьКоманду("ПланВидовХарактеристик.ПланВидовХарактеристик1.Команда.Команда1");
	ВызватьКоманду("ПланСчетов.ПланСчетов1.Команда.Команда1");
	ВызватьКоманду("ПланВидовРасчета.ПланВидовРасчета1.Команда.Команда1");
	ВызватьКоманду("РегистрСведений.РегистрСведений1.Команда.Команда1");
	ВызватьКоманду("РегистрНакопления.РегистрНакопления1.Команда.Команда1");
	ВызватьКоманду("РегистрБухгалтерии.РегистрБухгалтерии1.Команда.Команда1");
	ВызватьКоманду("РегистрРасчета.РегистрРасчета1.Команда.Команда1");
	ВызватьКоманду("БизнесПроцесс.БизнесПроцесс1.Команда.Команда1");
	ВызватьКоманду("Задача.Задача1.Команда.Команда1");
	
КонецПроцедуры

Процедура ВызватьКоманду(ИмяКоманды) Экспорт
	ПерейтиПоНавигационнойСсылке(СтрШаблон("e1cib/command/%1", ИмяКоманды));
КонецПроцедуры

#КонецОбласти
